_posts/2022-01-18-boj-9655.html
---
title: BOJ 9655 돌게임
tags: DP 수학
---

<div id="outline-container-orgb1648a6" class="outline-2">
<h2 id="orgb1648a6">돌게임</h2>
<div class="outline-text-2" id="text-orgb1648a6">
<ul class="org-ul">
<li>1, 3개의 돌을 순서대로 가져갈 때 승자 구하기</li>
</ul>
</div>
</div>

<div id="outline-container-org673e0e2" class="outline-2">
<h2 id="org673e0e2">접근하기</h2>
<div class="outline-text-2" id="text-org673e0e2">
<pre class="example">

1개
A

3개
A A A -&gt; A

4개    -&gt; B
A B B B
A A A B

5개
A B B B A  -&gt; A

규칙대로 써보면, 홀수이면 A, 짝수이면 B가 이김

</pre>
</div>
</div>

<div id="outline-container-org24f3864" class="outline-2">
<h2 id="org24f3864">코드1 - 홀짝</h2>
<div class="outline-text-2" id="text-org24f3864">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;stdio.h&gt;</span>

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #729fcf; font-weight: bold;">if</span> (N%2 == 1) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"SK\n"</span>);
    } <span style="color: #729fcf; font-weight: bold;">else</span> {
        printf(<span style="color: #ad7fa8; font-style: italic;">"CY\n"</span>);
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9a08cd" class="outline-2">
<h2 id="orgd9a08cd">코드2 - dp</h2>
<div class="outline-text-2" id="text-orgd9a08cd">
<ul class="org-ul">
<li>홀짝 규칙을 점화식으로</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;stdio.h&gt;</span>

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[1001];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    dp[0] = 0;
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    dp[1] = 1;  <span style="color: #888a85;">// </span><span style="color: #888a85;">Win SK</span>
    dp[2] = 0;
    dp[3] = 1;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=4;i&lt;=N;i++) {
        dp[i] = !dp[i-1];
    }
    <span style="color: #729fcf; font-weight: bold;">if</span> (dp[N]) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"SK\n"</span>);
    } <span style="color: #729fcf; font-weight: bold;">else</span> {
        printf(<span style="color: #ad7fa8; font-style: italic;">"CY\n"</span>);
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd51ea29" class="outline-2">
<h2 id="orgd51ea29">코드3 - dp - 최소 게임의 횟수를 dp[k]로 놓기</h2>
<div class="outline-text-2" id="text-orgd51ea29">
<ul class="org-ul">
<li>거리를 기준으로 하는 점화식 표현 가능</li>
</ul>

<pre class="example">
dp[k] : k번째 턴에서 최소 게임의 횟수

dp[0] = 0 
dp[1] = 1
dp[2] = 2
dp[3] = min(dp[3-3], dp[3-1]) + 1
...
dp[k] = min(dp[k-3], dp[k-1]) + 1
</pre>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[1010]; <span style="color: #888a85;">// </span><span style="color: #888a85;">dp[k] : &#52572;&#49548; &#44172;&#51076;&#51032; &#54943;&#49688;</span>

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    dp[0] = 0;
    dp[1] = 1;
    dp[2] = 2;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=3;i&lt;=N;i++) {
        dp[i] = min(dp[i-1], dp[i-3]) + 1;
    }

    <span style="color: #729fcf; font-weight: bold;">if</span> (dp[N] % 2 == 1) 
        printf(<span style="color: #ad7fa8; font-style: italic;">"SK\n"</span>);
    <span style="color: #729fcf; font-weight: bold;">else</span>
        printf(<span style="color: #ad7fa8; font-style: italic;">"CY\n"</span>);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org4f065a1" class="outline-2">
<h2 id="org4f065a1">문제 링크</h2>
<div class="outline-text-2" id="text-org4f065a1">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/9655">https://www.acmicpc.net/problem/9655</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1617447" class="outline-2">
<h2 id="org1617447">풀이/설명 참고</h2>
<div class="outline-text-2" id="text-org1617447">
<ul class="org-ul">
<li><a href="https://beginnerdeveloper-lit.tistory.com/83">https://beginnerdeveloper-lit.tistory.com/83</a></li>
</ul>
</div>
</div>
